[
    {"text": "“Dan barangsiapa bertawakkal kepada Allah, niscaya Allah akan mencukupkan (keperluannya).”", "source": "(QS. At-Talaq: 3)"},
    {"text": "“Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya.”", "source": "(QS. Al-Baqarah: 286)"},
    {"text": "“Sebaik-baik manusia adalah yang paling bermanfaat bagi manusia (lainnya).”", "source": "(HR. Ahmad)"},
    {"text": "“Janganlah kamu bersikap lemah, dan janganlah (pula) kamu bersedih hati, padahal kamulah orang-orang yang paling tinggi (derajatnya), jika kamu orang-orang yang beriman.”", "source": "(QS. Ali Imran: 139)"},
    {"text": "“Sesungguhnya sesudah kesulitan itu ada kemudahan.”", "source": "(QS. Al-Insyirah: 6)"},
    {"text": "“Dan dirikanlah shalat, tunaikanlah zakat, dan rukuklah beserta orang-orang yang rukuk.”", "source": "(QS. Al-Baqarah: 43)"},
    {"text": "“Sesungguhnya Allah menyukai orang-orang yang bertawakal kepada-Nya.”", "source": "(QS. Ali Imran: 159)"},
    {"text": "“Barangsiapa yang beriman kepada Allah dan hari akhir, hendaklah ia berkata yang baik atau diam.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Sesungguhnya Allah tidak akan mengubah keadaan suatu kaum sebelum mereka mengubah keadaan diri mereka sendiri.”", "source": "(QS. Ar-Ra’d: 11)"},
    {"text": "“Tolonglah saudaramu yang berbuat zalim dan yang dizalimi.”", "source": "(HR. Bukhari)"},
    {"text": "“Dan janganlah kamu berjalan di muka bumi ini dengan sombong, karena sesungguhnya kamu sekali-kali tidak dapat menembus bumi dan sekali-kali kamu tidak akan sampai setinggi gunung.”", "source": "(QS. Al-Isra: 37)"},
    {"text": "“Sesungguhnya Allah mencintai orang-orang yang bertaubat dan menyucikan diri.”", "source": "(QS. Al-Baqarah: 222)"},
    {"text": "“Barangsiapa yang menempuh jalan untuk mencari ilmu, maka Allah akan memudahkan baginya jalan ke surga.”", "source": "(HR. Muslim)"},
    {"text": "“Dan janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya tiada berputus asa dari rahmat Allah, melainkan kaum yang kafir.”", "source": "(QS. Yusuf: 87)"},
    {"text": "“Orang yang kuat bukanlah yang pandai bergulat, tetapi orang yang kuat adalah yang mampu mengendalikan dirinya ketika marah.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Dan bersegeralah kamu kepada ampunan dari Tuhanmu dan kepada surga yang luasnya seluas langit dan bumi yang disediakan untuk orang-orang yang bertakwa.”", "source": "(QS. Ali Imran: 133)"},
    {"text": "“Sesungguhnya Allah tidak melihat kepada rupa dan harta kalian, tetapi Allah melihat kepada hati dan amal kalian.”", "source": "(HR. Muslim)"},
    {"text": "“Dan janganlah kamu iri hati terhadap apa yang dikaruniakan Allah kepada sebagian kamu lebih banyak dari sebagian yang lain.”", "source": "(QS. An-Nisa: 32)"},
    {"text": "“Barangsiapa yang tidak menyayangi, maka dia tidak akan disayangi.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Dan tolong-menolonglah kamu dalam (mengerjakan) kebajikan dan takwa, dan jangan tolong-menolong dalam berbuat dosa dan pelanggaran.”", "source": "(QS. Al-Maidah: 2)"},
    {"text": "“Barangsiapa yang menunjukkan kepada kebaikan, maka dia akan mendapatkan pahala seperti pahala orang yang mengerjakannya.”", "source": "(HR. Muslim)"},
    {"text": "“Dan janganlah kamu memalingkan wajahmu dari manusia karena sombong, dan janganlah kamu berjalan di muka bumi dengan angkuh.”", "source": "(QS. Luqman: 18)"},
    {"text": "“Sesungguhnya Allah mencintai orang-orang yang berbuat baik.”", "source": "(QS. Al-Baqarah: 195)"},
    {"text": "“Barangsiapa yang memudahkan urusan orang lain, maka Allah akan memudahkan urusannya di dunia dan akhirat.”", "source": "(HR. Muslim)"},
    {"text": "“Dan janganlah kamu mendekati zina; sesungguhnya zina itu adalah suatu perbuatan yang keji dan suatu jalan yang buruk.”", "source": "(QS. Al-Isra: 32)"},
    {"text": "“Barangsiapa yang bersabar, maka Allah akan menjadikannya sabar.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Dan barang siapa yang bertakwa kepada Allah, niscaya Allah jadikan baginya kemudahan dalam urusannya.”", "source": "(QS. At-Talaq: 4)"},
    {"text": "“Dan carilah pertolongan dalam kesabaran dan shalat.”", "source": "(QS. Al-Baqarah: 45)"},
    {"text": "“Jika kamu melakukan dosa sampai dosamu mencapai langit, maka kamu harus bertobat, tobatmu akan diterima.”", "source": "(HR. Ibnu Majah)"},
    {"text": "“Tuntun kami ke jalan yang lurus.”", "source": "(QS. Al-Fatihah: 6)"},
    {"text": "“Inilah kitab yang tidak diragukan lagi, petunjuk bagi orang-orang yang bertakwa.”", "source": "(QS. Al-Baqarah: 2)"},
    {"text": "“Janganlah kamu berduka cita, sesungguhnya Allah selalu bersama kita.”", "source": "(QS. At-Taubah: 40)"},
    {"text": "“Boleh jadi kamu membenci sesuatu, padahal ia amat baik bagimu, dan boleh jadi (pula) kamu menyukai sesuatu, padahal ia amat buruk bagimu. Allah mengetahui, sedang kamu tidak mengetahui.”", "source": "(QS. Al-Baqarah: 216)"},
    {"text": "“Barangsiapa yang bersabar, maka Allah akan memberikan jalan keluar.”", "source": "(QS. Al-Baqarah: 155)"},
    {"text": "“Sesungguhnya setiap amal itu tergantung niatnya.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Sesungguhnya bersihnya hati adalah lebih utama daripada bersihnya tubuh.”", "source": "(HR. Muslim)"},
    {"text": "“Bersemangatlah atas hal-hal yang bermanfaat bagimu. Minta tolonglah pada Allah, jangan engkau lemah.”", "source": "(HR. Muslim)"},
    {"text": "“Apakah manusia itu mengira bahwa mereka dibiarkan (saja) mengatakan, 'Kami telah beriman' sedang mereka tidak diuji lagi?”", "source": "(QS. Al-'Ankabut: 2)"},
    {"text": "“Dan barang siapa berpegang teguh kepada Allah, maka sesungguhnya ia telah diberi petunjuk ke jalan yang lurus.”", "source": "(QS. Ali Imran: 101)"},
    {"text": "“Sebaik-baik pekerjaan ialah usahanya seseorang pekerja apabila ia berbuat sebaik-baiknya (profesional).”", "source": "(HR. Ahmad)"},
    {"text": "“Bangunlah pagi hari untuk mencari rezeki dan kebutuhan-kebutuhanmu. Sesungguhnya pada pagi hari terdapat barakah dan keberuntungan.”", "source": "(HR. At-Thabrani dan Al-Bazzar)"},
    {"text": "“Sesungguhnya rahmat Allah amat dekat kepada orang-orang yang berbuat baik.”", "source": "(QS. Al-A'raf: 56)"},
    {"text": "“Sesungguhnya bersama kesulitan ada kemudahan.”", "source": "(QS. Al-Insyirah: 5)"},
    {"text": "“Hai orang-orang yang beriman, bertakwalah kepada Allah dan katakanlah perkataan yang benar.”", "source": "(QS. Al-Ahzab: 70)"},
    {"text": "“Dan bersabarlah, sesungguhnya Allah beserta orang-orang yang sabar.”", "source": "(QS. Al-Anfal: 46)"},
    {"text": "“Dan kepada Tuhanmulah hendaknya kamu berharap.”", "source": "(QS. Al-Insyirah: 8)"},
    {"text": "“Sesungguhnya shalat itu mencegah dari perbuatan keji dan mungkar.”", "source": "(QS. Al-Ankabut: 45)"},
    {"text": "“Tidak sempurna iman salah seorang dari kalian hingga ia mencintai saudaranya sebagaimana ia mencintai dirinya sendiri.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Jagalah Allah, niscaya Allah akan menjagamu.”", "source": "(HR. Tirmidzi)"},
    {"text": "“Senyumanmu kepada saudaramu adalah sedekah.”", "source": "(HR. Tirmidzi)"},
    {"text": "“Hendaklah kalian saling memberi hadiah, niscaya kalian akan saling mencintai.”", "source": "(HR. Bukhari)"},
    {"text": "“Orang yang paling dicintai Allah adalah yang paling bermanfaat bagi orang lain.”", "source": "(HR. Thabrani)"},
    {"text": "“Mintalah pertolongan (kepada Allah) dengan sabar dan shalat.”", "source": "(QS. Al-Baqarah: 45)"},
    {"text": "“Sesungguhnya orang-orang yang beriman dan mengerjakan amal saleh, mereka itu adalah sebaik-baik makhluk.”", "source": "(QS. Al-Bayyinah: 7)"},
    {"text": "“Jangan marah!”", "source": "(HR. Bukhari)"},
    {"text": "“Tidak akan masuk surga orang yang di dalam hatinya terdapat kesombongan walaupun sebesar biji sawi.”", "source": "(HR. Muslim)"},
    {"text": "“Bertakwalah kepada Allah di mana pun kamu berada.”", "source": "(HR. Tirmidzi)"},
    {"text": "“Setiap kebaikan adalah sedekah.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Sesungguhnya dunia ini adalah perhiasan, dan sebaik-baik perhiasan dunia adalah wanita shalihah.”", "source": "(HR. Muslim)"},
    {"text": "“Jadilah kamu di dunia seperti orang asing atau orang yang sedang dalam perjalanan.”", "source": "(HR. Bukhari)"},
    {"text": "“Apabila kamu marah, maka diamlah.”", "source": "(HR. Ahmad)"},
    {"text": "“Dan bersabarlah kamu, karena sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang berbuat kebaikan.”", "source": "(QS. Hud: 115)"},
    {"text": "“Dan janganlah kamu menyembunyikan kesaksian, dan barang siapa menyembunyikannya, maka sesungguhnya hatinya berdosa.”", "source": "(QS. Al-Baqarah: 283)"},
    {"text": "“Sesungguhnya orang-orang yang banyak bersalawat kepadaku, mereka adalah orang yang paling dekat denganku di hari kiamat.”", "source": "(HR. Tirmidzi)"},
    {"text": "“Tidak akan beriman salah seorang dari kalian hingga ia mencintai saudaranya seperti mencintai dirinya sendiri.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Sesungguhnya Allah Maha Lembut dan menyukai kelembutan dalam segala urusan.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Hindarilah prasangka, karena prasangka adalah ucapan paling dusta.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Tiada suatu ucapan pun yang diucapkannya melainkan ada di dekatnya malaikat pengawas yang selalu hadir.”", "source": "(QS. Qaf: 18)"},
    {"text": "“Dan katakanlah kepada hamba-hamba-Ku: ‘Hendaklah mereka mengucapkan perkataan yang lebih baik.’”", "source": "(QS. Al-Isra: 53)"},
    {"text": "“Sesungguhnya di antara manusia ada yang menjadi kunci kebaikan dan penutup kejahatan.”", "source": "(HR. Ibnu Majah)"},
    {"text": "“Tidak ada iri hati kecuali pada dua hal: orang yang diberi ilmu dan mengamalkannya, dan orang yang diberi harta lalu menafkahkannya.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Jagalah dirimu dari api neraka walau dengan setengah butir kurma.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Shalat adalah tiang agama, barang siapa mendirikannya maka ia telah menegakkan agama.”", "source": "(HR. Baihaqi)"},
    {"text": "“Barang siapa tidak meninggalkan perkataan dusta dan mengamalkannya, maka Allah tidak butuh terhadap puasanya.”", "source": "(HR. Bukhari)"},
    {"text": "“Sesungguhnya Allah itu baik dan tidak menerima kecuali yang baik.”", "source": "(HR. Muslim)"},
    {"text": "“Barang siapa menutupi aib seorang Muslim, Allah akan menutupi aibnya di dunia dan akhirat.”", "source": "(HR. Muslim)"},
    {"text": "“Sesungguhnya amal yang paling dicintai Allah adalah amal yang terus-menerus meskipun sedikit.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Barang siapa menempuh jalan untuk mencari ilmu, maka Allah akan mudahkan jalannya ke surga.”", "source": "(HR. Muslim)"},
    {"text": "“Dan apabila kamu menghukum, maka hukumlah dengan adil.”", "source": "(QS. An-Nahl: 90)"},
    {"text": "“Sesungguhnya Allah memerintahkan berlaku adil dan berbuat kebajikan.”", "source": "(QS. An-Nahl: 90)"},
    {"text": "“Allah melaknat orang yang menyuap dan yang menerima suap.”", "source": "(HR. Tirmidzi)"},
    {"text": "“Dan janganlah sebagian kamu menggunjing sebagian yang lain.”", "source": "(QS. Al-Hujurat: 12)"},
    {"text": "“Sesungguhnya orang mukmin itu bersaudara.”", "source": "(QS. Al-Hujurat: 10)"},
    {"text": "“Cukuplah seseorang disebut pendusta ketika ia menyampaikan segala apa yang didengarnya.”", "source": "(HR. Muslim)"},
    {"text": "“Tiada kebaikan dalam kebanyakan bisikan-bisikan mereka, kecuali orang yang menyuruh (manusia) bersedekah atau berbuat kebaikan.”", "source": "(QS. An-Nisa: 114)"},
    {"text": "“Berpalinglah kamu dari orang yang berpaling dari peringatan Kami dan tidak menginginkan selain kehidupan dunia.”", "source": "(QS. An-Najm: 29-30)"},
    {"text": "“Dan barang siapa mengerjakan amal saleh, laki-laki maupun perempuan, dalam keadaan beriman, maka mereka akan masuk surga.”", "source": "(QS. An-Nisa: 124)"},
    {"text": "“Sesungguhnya Allah menyuruh (kamu) menyampaikan amanat kepada yang berhak menerimanya.”", "source": "(QS. An-Nisa: 58)"},
    {"text": "“Dan barang siapa membunuh seorang mukmin dengan sengaja, maka balasannya ialah neraka Jahanam.”", "source": "(QS. An-Nisa: 93)"},
    {"text": "“Janganlah kamu menjual ayat-ayat-Ku dengan harga yang murah.”", "source": "(QS. Al-Baqarah: 41)"},
    {"text": "“Sesungguhnya orang-orang yang menyembunyikan apa yang telah Kami turunkan dari keterangan-keterangan (yang jelas) dan petunjuk setelah Kami menerangkannya kepada manusia dalam Al-Kitab, mereka itu dilaknat Allah.”", "source": "(QS. Al-Baqarah: 159)"},
    {"text": "“Sesungguhnya shalat itu mencegah dari perbuatan keji dan mungkar.”", "source": "(QS. Al-Ankabut: 45)"},
    {"text": "“Dan berbuat baiklah (kepada orang lain) sebagaimana Allah telah berbuat baik kepadamu.”", "source": "(QS. Al-Qasas: 77)"},
    {"text": "“Dan janganlah kamu membunuh jiwa yang diharamkan Allah (membunuhnya) melainkan dengan suatu (alasan) yang benar.”", "source": "(QS. Al-Isra: 33)"},
    {"text": "“Hendaklah kamu saling memberi hadiah, karena hadiah itu dapat menghilangkan kebencian.”", "source": "(HR. Bukhari)"},
    {"text": "“Tidak sempurna iman seseorang dari kalian hingga ia mencintai untuk saudaranya apa yang ia cintai untuk dirinya sendiri.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Sesungguhnya setiap amal perbuatan tergantung pada niatnya.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Jangan marah, dan bagimu surga.”", "source": "(HR. Thabrani)"},
    {"text": "“Orang yang memberi makanan berbuka bagi orang yang berpuasa, maka baginya pahala seperti orang yang berpuasa.”", "source": "(HR. Tirmidzi)"},
    {"text": "“Apabila seseorang meninggal dunia, maka terputuslah amalannya kecuali tiga perkara: sedekah jariyah, ilmu yang bermanfaat, dan anak shaleh yang mendoakannya.”", "source": "(HR. Muslim)"},
    {"text": "“Sesungguhnya shalat itu mencegah dari perbuatan keji dan mungkar.”", "source": "(QS. Al-Ankabut: 45)"},
    {"text": "“Dan berbuat baiklah (kepada orang lain) sebagaimana Allah telah berbuat baik kepadamu.”", "source": "(QS. Al-Qasas: 77)"},
    {"text": "“Dan janganlah kamu membunuh jiwa yang diharamkan Allah (membunuhnya) melainkan dengan suatu (alasan) yang benar.”", "source": "(QS. Al-Isra: 33)"},
    {"text": "“Hendaklah kamu saling memberi hadiah, karena hadiah itu dapat menghilangkan kebencian.”", "source": "(HR. Bukhari)"},
    {"text": "“Tidak sempurna iman seseorang dari kalian hingga ia mencintai untuk saudaranya apa yang ia cintai untuk dirinya sendiri.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Sesungguhnya setiap amal perbuatan tergantung pada niatnya.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Jangan marah, dan bagimu surga.”", "source": "(HR. Thabrani)"},
    {"text": "“Orang yang memberi makanan berbuka bagi orang yang berpuasa, maka baginya pahala seperti orang yang berpuasa.”", "source": "(HR. Tirmidzi)"},
    {"text": "“Apabila seseorang meninggal dunia, maka terputuslah amalannya kecuali tiga perkara: sedekah jariyah, ilmu yang bermanfaat, dan anak shaleh yang mendoakannya.”", "source": "(HR. Muslim)"},
    {"text": "“Dan berbuat baiklah (kepada orang lain) sebagaimana Allah telah berbuat baik kepadamu.”", "source": "(QS. Al-Qasas: 77)"},
    {"text": "“Dan janganlah kamu membunuh jiwa yang diharamkan Allah (membunuhnya) melainkan dengan suatu (alasan) yang benar.”", "source": "(QS. Al-Isra: 33)"},
    {"text": "“Hendaklah kamu saling memberi hadiah, karena hadiah itu dapat menghilangkan kebencian.”", "source": "(HR. Bukhari)"},
    {"text": "“Tidak sempurna iman seseorang dari kalian hingga ia mencintai untuk saudaranya apa yang ia cintai untuk dirinya sendiri.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Sesungguhnya setiap amal perbuatan tergantung pada niatnya.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Jangan marah, dan bagimu surga.”", "source": "(HR. Thabrani)"},
    {"text": "“Orang yang memberi makanan berbuka bagi orang yang berpuasa, maka baginya pahala seperti orang yang berpuasa.”", "source": "(HR. Tirmidzi)"},
    {"text": "“Apabila seseorang meninggal dunia, maka terputuslah amalannya kecuali tiga perkara: sedekah jariyah, ilmu yang bermanfaat, dan anak shaleh yang mendoakannya.”", "source": "(HR. Muslim)"}
  ]
