[
    {"text": "“Dan barangsiapa bertawakkal kepada Allah, niscaya Allah akan mencukupkan (keperluannya).”", "source": "(QS. At-Talaq: 3)"},
    {"text": "“Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya.”", "source": "(QS. Al-Baqarah: 286)"},
    {"text": "“Sebaik-baik manusia adalah yang paling bermanfaat bagi manusia (lainnya).”", "source": "(HR. Ahmad)"},
    {"text": "“Janganlah kamu bersikap lemah, dan janganlah (pula) kamu bersedih hati, padahal kamulah orang-orang yang paling tinggi (derajatnya), jika kamu orang-orang yang beriman.”", "source": "(QS. Ali Imran: 139)"},
    {"text": "“Sesungguhnya sesudah kesulitan itu ada kemudahan.”", "source": "(QS. Al-Insyirah: 6)"},
    {"text": "“Dan dirikanlah shalat, tunaikanlah zakat, dan rukuklah beserta orang-orang yang rukuk.”", "source": "(QS. Al-Baqarah: 43)"},
    {"text": "“Sesungguhnya Allah menyukai orang-orang yang bertawakal kepada-Nya.”", "source": "(QS. Ali Imran: 159)"},
    {"text": "“Barangsiapa yang beriman kepada Allah dan hari akhir, hendaklah ia berkata yang baik atau diam.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Sesungguhnya Allah tidak akan mengubah keadaan suatu kaum sebelum mereka mengubah keadaan diri mereka sendiri.”", "source": "(QS. Ar-Ra’d: 11)"},
    {"text": "“Tolonglah saudaramu yang berbuat zalim dan yang dizalimi.”", "source": "(HR. Bukhari)"},
    {"text": "“Dan janganlah kamu berjalan di muka bumi ini dengan sombong, karena sesungguhnya kamu sekali-kali tidak dapat menembus bumi dan sekali-kali kamu tidak akan sampai setinggi gunung.”", "source": "(QS. Al-Isra: 37)"},
    {"text": "“Sesungguhnya Allah mencintai orang-orang yang bertaubat dan menyucikan diri.”", "source": "(QS. Al-Baqarah: 222)"},
    {"text": "“Barangsiapa yang menempuh jalan untuk mencari ilmu, maka Allah akan memudahkan baginya jalan ke surga.”", "source": "(HR. Muslim)"},
    {"text": "“Dan janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya tiada berputus asa dari rahmat Allah, melainkan kaum yang kafir.”", "source": "(QS. Yusuf: 87)"},
    {"text": "“Orang yang kuat bukanlah yang pandai bergulat, tetapi orang yang kuat adalah yang mampu mengendalikan dirinya ketika marah.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Dan bersegeralah kamu kepada ampunan dari Tuhanmu dan kepada surga yang luasnya seluas langit dan bumi yang disediakan untuk orang-orang yang bertakwa.”", "source": "(QS. Ali Imran: 133)"},
    {"text": "“Sesungguhnya Allah tidak melihat kepada rupa dan harta kalian, tetapi Allah melihat kepada hati dan amal kalian.”", "source": "(HR. Muslim)"},
    {"text": "“Dan janganlah kamu iri hati terhadap apa yang dikaruniakan Allah kepada sebagian kamu lebih banyak dari sebagian yang lain.”", "source": "(QS. An-Nisa: 32)"},
    {"text": "“Barangsiapa yang tidak menyayangi, maka dia tidak akan disayangi.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Dan tolong-menolonglah kamu dalam (mengerjakan) kebajikan dan takwa, dan jangan tolong-menolong dalam berbuat dosa dan pelanggaran.”", "source": "(QS. Al-Maidah: 2)"},
    {"text": "“Barangsiapa yang menunjukkan kepada kebaikan, maka dia akan mendapatkan pahala seperti pahala orang yang mengerjakannya.”", "source": "(HR. Muslim)"},
    {"text": "“Dan janganlah kamu memalingkan wajahmu dari manusia karena sombong, dan janganlah kamu berjalan di muka bumi dengan angkuh.”", "source": "(QS. Luqman: 18)"},
    {"text": "“Sesungguhnya Allah mencintai orang-orang yang berbuat baik.”", "source": "(QS. Al-Baqarah: 195)"},
    {"text": "“Barangsiapa yang memudahkan urusan orang lain, maka Allah akan memudahkan urusannya di dunia dan akhirat.”", "source": "(HR. Muslim)"},
    {"text": "“Dan janganlah kamu mendekati zina; sesungguhnya zina itu adalah suatu perbuatan yang keji dan suatu jalan yang buruk.”", "source": "(QS. Al-Isra: 32)"},
    {"text": "“Barangsiapa yang bersabar, maka Allah akan menjadikannya sabar.”", "source": "(HR. Bukhari dan Muslim)"},
    {"text": "“Dan janganlah kamu berjalan di muka bumi ini dengan sombong, karena sesungguhnya kamu sekali-kali tidak dapat menembus bumi dan sekali-kali kamu tidak akan sampai setinggi gunung.”", "source": "(QS. Al-Isra: 37)"},
    {"text": "“Sesungguhnya Allah mencintai orang-orang yang bertawakal kepada-Nya.”", "source": "(QS. Ali Imran: 159)"},
    {"text": "“Barangsiapa yang beriman kepada Allah dan hari akhir, hendaklah ia berkata yang baik atau diam.”", "source": "(HR. Bukhari dan Muslim)"}
]